cask_args appdir: '/Applications'

tap 'homebrew/core'
tap "homebrew/bundle"
tap "homebrew/services"
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Binaries
brew 'curl'
brew 'git'
brew "git-lfs"
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
brew 'mas' # Mac App Store manager
brew 'wget'

# Development
cask 'postman'
cask 'charles'
cask 'docker'
brew 'composer'
brew 'yarn'
brew 'postgres'
brew 'sip'
brew 'now'
cask 'sf-symbols'
cask 'reactotron'
cask 'tower'

# Terminal
cask 'iterm2'

# Browsers
cask 'google-chrome'
cask 'firefox'
cask 'microsoft-edge'

# Editors
cask 'visual-studio-code'
cask 'macvim'

# Applications
cask 'spectrum'
cask 'discord'
cask 'figma'
cask 'nordvpn'
#cask 'slack'
cask 'vlc'
cask 'skype'
#cask 'teamviewer'
cask 'imagealpha'
cask 'imageoptim'
cask 'keybase'
cask 'timely'
cask 'moom'
cask 'acelink'

# Cloud
cask 'dropbox'

# Media
cask 'spotify'
cask 'tidal'

# Quicklook Plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'provisionql'
cask 'quicklookapk'
cask 'epubquicklook'
cask 'betterzipql'
cask 'webpquicklook'
cask 'suspicious-package'

# App Store applications
#mas 'Xcode', id: 497799835